1s/ERP/Conf/Catalogs/Лико_Формы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_Формы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПечати</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ВидыПечати</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦветаУдалить</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ТипыЦвета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКраски</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Название</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Пантоны</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаСписана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УголПоворотаРастра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_УглыПоворотаРастра</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПоРельсе</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТрафаретнаяСетка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ТрафаретныеСетки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПолимера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ВидыПолимеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСекции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ВидыСекций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пересвет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦвета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ТипыЦвета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказТех</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грамматура</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗаливки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДистортФлексо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ДистортыФлексо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШагПечати</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЛинкс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сплошная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолщинаПолимера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействияСФормой</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ДействияСФормой</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Этикетки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_Формы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 	
	СписокИстрияФормы.Параметры.УстановитьЗначениеПараметра("Форма",Объект.Ссылка);
	
	Если Параметры.Свойство("Заказ") Тогда
		ЗаказОткрытия = Параметры.Заказ;
	КонецЕсли;   
	
	// --> Начало Лико Ефимов ЕВВ 16.06.2025
	Если НЕ РольДоступна("ПолныеПрава") Тогда
		Элементы.Код.ТолькоПросмотр = Истина; 
		Элементы.Сплошная.ТолькоПросмотр = Истина;
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 16.06.2025
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ИзменитьПараметрВЗаказах(Объект.Ссылка,Объект.Грамматура,Объект.ПроцентЗаливки,ЗаказОткрытия);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьПараметрВЗаказах(Форма,Грамматура,ПроцентЗаливки,ЗаказОткрытия)
	
	УстановитьПривилегированныйРежим(Истина);
	ЗапросЗаказы = Новый Запрос;
	ЗапросЗаказы.Текст = 
	"ВЫБРАТЬ
	|	ЗаказКлиентаЦвета.Ссылка КАК Заказ,
	|	ЗаказКлиентаЦвета.КлючСтроки КАК КлючСтроки,
	|	ЗаказКлиентаЦвета.Ссылка.НомерБезПрефикса КАК НомерБезПрефикса
	|ИЗ
	|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
	|ГДЕ
	|	ЗаказКлиентаЦвета.Форма = &Форма
	|	И (ЗаказКлиентаЦвета.Грамматура <> &Грамматура
	|			ИЛИ ЗаказКлиентаЦвета.ПроцентЗаливки <> &ПроцентЗаливки)";
	ЗапросЗаказы.УстановитьПараметр("Форма", Форма);
	Если ЗначениеЗаполнено(Грамматура) И ЗначениеЗаполнено(ПроцентЗаливки) Тогда
		ЗапросЗаказы.УстановитьПараметр("Грамматура", Число(Формат(Грамматура * 0.5,"ЧЦ=4; ЧДЦ=1")));
		ЗапросЗаказы.УстановитьПараметр("ПроцентЗаливки", Число(Формат(ПроцентЗаливки,"ЧЦ=3; ЧДЦ=0")));
	ИначеЕсли ЗначениеЗаполнено(Грамматура) Тогда
		ЗапросЗаказы.Текст = СтрЗаменить(ЗапросЗаказы.Текст, "И (ЗаказКлиентаЦвета.Грамматура <> &Грамматура","И ЗаказКлиентаЦвета.Грамматура <> &Грамматура");
		ЗапросЗаказы.Текст = СтрЗаменить(ЗапросЗаказы.Текст, "ИЛИ ЗаказКлиентаЦвета.ПроцентЗаливки <> &ПроцентЗаливки)","");
		ЗапросЗаказы.УстановитьПараметр("Грамматура", Число(Формат(Грамматура * 0.5,"ЧЦ=4; ЧДЦ=1")));
	ИначеЕсли ЗначениеЗаполнено(ПроцентЗаливки) Тогда
		ЗапросЗаказы.Текст = СтрЗаменить(ЗапросЗаказы.Текст, "И (ЗаказКлиентаЦвета.Грамматура <> &Грамматура","");
		ЗапросЗаказы.Текст = СтрЗаменить(ЗапросЗаказы.Текст, "ИЛИ ЗаказКлиентаЦвета.ПроцентЗаливки <> &ПроцентЗаливки)","И ЗаказКлиентаЦвета.ПроцентЗаливки <> &ПроцентЗаливки");
		ЗапросЗаказы.УстановитьПараметр("ПроцентЗаливки", Число(Формат(ПроцентЗаливки,"ЧЦ=3; ЧДЦ=0")));
	Иначе
		Возврат;
	КонецЕсли;
	Выборка = ЗапросЗаказы.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Заказ = ЗаказОткрытия Тогда
			Продолжить;	
		КонецЕсли;
		ЗаказОбъект = Выборка.Заказ.ПолучитьОбъект();
		Стр = ЗаказОбъект.Цвета.Найти(Выборка.КлючСтроки, "КлючСтроки");
		Если ЗначениеЗаполнено(ПроцентЗаливки) Тогда
			Стр.ПроцентЗаливки = ПроцентЗаливки;
		КонецЕсли;
		Если ЗначениеЗаполнено(Грамматура) Тогда
			Стр.Грамматура = Грамматура * 0.5;
		КонецЕсли;
		ЗаказОбъект.ОбменДанными.Загрузка = Истина;
		ЗаказОбъект.Записать(РежимЗаписиДокумента.Запись);
		Сообщить("Записан заказ "+ Выборка.НомерБезПрефикса); 
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
